import React from "react";
import styled from "styled-components";
import Models from "../components/Models.js";
import Models2 from "../components/Models2.js";
import Models3 from "../components/Models3.js";
import Models4 from "../components/Models4.js";
import Models5 from "../components/Models5.js";

const Div1 = styled.div`
  box-sizing: border-box;
  display: flex;
  flex-direction: row;
  height: 100%;
  width: 100%;
  background-color: grey;
  align-items: center;
  justify-content: space-evenly;
`;
const Div11 = styled.div`
  max-width: 50%;
  color: black;
`;
const Div12 = styled.div`
  box-sizing: border-box;
  width: 35%;
  height: 50%;
  background-color: black;
`;
const Div2 = styled.div`
  box-sizing: border-box;
  display: flex;
  flex-direction: row-reverse;
  height: 100%;
  width: 100%;
  background-color: black;
  align-items: center;
  justify-content: space-evenly;
`;
const Div21 = styled.div`
  max-width: 50%;
  color: grey;
`;
const Div22 = styled.div`
  box-sizing: border-box;
  width: 35%;
  height: 50%;
  background-color: grey;
`;
const Div3 = styled.div`
  box-sizing: border-box;
  display: flex;
  flex-direction: row;
  height: 100%;
  width: 100%;
  background-color: grey;
  align-items: center;
  justify-content: space-evenly;
`;
const Div31 = styled.div`
  max-width: 50%;
  color: black;
`;
const Div32 = styled.div`
  box-sizing: border-box;
  width: 35%;
  height: 50%;
  background-color: black;
`;
const Div4 = styled.div`
  box-sizing: border-box;
  display: flex;
  flex-direction: row-reverse;
  height: 100%;
  width: 100%;
  background-color: black;
  align-items: center;
  justify-content: space-evenly;
`;
const Div41 = styled.div`
  max-width: 50%;
  color: grey;
`;
const Div42 = styled.div`
  box-sizing: border-box;
  width: 35%;
  height: 50%;
  background-color: grey;
`;
const Div5 = styled.div`
  box-sizing: border-box;
  display: flex;
  flex-direction: row;
  height: 100%;
  width: 100%;
  background-color: grey;
  align-items: center;
  justify-content: space-evenly;
`;
const Div51 = styled.div`
  max-width: 50%;
  color: black;
`;
const Div52 = styled.div`
  box-sizing: border-box;
  width: 35%;
  height: 50%;
  background-color: black;
`;
const Home = () => {
  return (
    <>
      <Div1>
        <Div11>
          Направление туризма: этнографический;<br></br>
          Трасса похода: Якутск-Батагай-Алыта-местность Чинэндьэ;<br></br>
          Протяженность: 130 км от п.Батагай-Алыта;<br></br>
          Продолжительность: 8 дней/7 ночей;<br></br>
          Число туристов в одной группе: до 6 чел.;<br></br>
          Период похода: с марта по конец сентября;<br></br>
          Маршрут пролегает по горно-тундровой местности.<br></br>
          Способ передвижения: снегоход или квадроцикл (в зависимости от сезона);<br></br>
          В кочевой школе «Мэрлэнкэ» в оленеводческом стаде «Кочевник №1» в весенне-летний и
          осенний период дети учатся в сезонной кочевой школе и работают
          помощниками оленеводов и чумработников. Попав сюда, туристы
          познакомятся с жизнью кочевых народов, с их культурой и бытом. Увидят,
          как дети пасут оленей, следят за табуном и за новорожденными
          оленятами, вылавливают арканом оленей из стада и устанавливают их в
          упряжь. У туристов есть возможность узнать, как собирается чум, как
          делают нарты. Попробуют блюда национальной кухни: блюда из оленины.
          Посетят наледь реки и поднимутся на горы.
        </Div11>
        <Div12>
          <Models />
        </Div12>
      </Div1>
      <Div2>
        <Div21>
          Направление туризма: лечебный;<br></br>
          Маршрут: с.Батагай-Алыта – Джаргалах - оз.Буора.<br></br>
          Протяженность маршрута: 110 км от п.Батагай-Алыта.
          Продолжительность - 8 дней/ 7ночей Группа: 6 человек.<br></br>
          Сезонность: июнь, июль, август.<br></br>
          Способ передвижения: квадроцикл.<br></br>
          Путешествие на Озеро Долгожителей.<br></br>
          Особую ценность представляет собой наличие в воде солей кремнистой кислоты. Этот показатель многие исследователи считают
          водой «долгожителей». Это подтверждает и то, что жители в окрестностях
          озера Буора отличаются своим отменным здоровьем и долголетием.
          Химический анализ воды по показателям превосходит источники Кавказа и
          Тувы.
        </Div21>
        <Div22>
          <Models2 />
        </Div22>
      </Div2>
      <Div3>
        <Div31>
          Направление туризма: этнографический;<br></br>
          Маршрут: Саккырыр – Чубукулаах – Тыаллаах Таас – Буучээннээх – Тарыннаах – Торут - оз.Буора.<br></br>
          Протяженность маршрута: - 190 км.<br></br>
          Продолжительность: 12 дней;<br></br>
          Группа от 5 до 9 человек;<br></br>
          Сезонность февраль, март, апрель<br></br>
          Способ передвижения: на оленьих упряжках.<br></br>
          Экстремальное путешествие «Оленьи тропы»
          возвращает человека к старым, добрым временам, с простыми заботами,
          взаимовыручкой и единении с природой. Именно так жили эвенские роды
          Тюгясира. Первозданные горы, перевалы и наледи, сакральные места и
          древние стойбища охотников.
        </Div31>
        <Div32>
          <Models3 />
        </Div32>
      </Div3>
      <Div4>
        <Div41>
          Направление туризма: этнографический - экологический;<br></br>
          Маршрут: с.Батагай-Алыта – Чаккырас (или
          Дьайбалаах) – Оспох (коневодческая база).<br></br>
          Протяженность маршрута: 50
          км от п. Батагай-Алыта;<br></br>
          Продолжительность: 14 дней;<br></br>
          Группа: 2-3
          человека.<br></br>
          Сезонность: март, апрель, май, август, сентябрь<br></br>
          Путешествие
          на аборигенных якутских лошадях по горам и перевалам. Обучение азам
          табунного коневодства на коневодческой базе «Оспох». Проводник и
          хозяин базы – герой документального фильма «24 снега». По
          представлениям народа саха, лошадь — священное животное небесного
          происхождения. Разводят данную породу только на территории Республики
          Саха (только в арктических улусах). Живут под открытым небом,
          небольшими табунами. Способны легко преодолевать большие расстояния.
          Зимой основную часть времени проводят в поисках подножного корма,
          разбивая крепкими копытами наст. Живут долго, используются в работе до
          27 лет.
        </Div41>
        <Div42>
          <Models4 />
        </Div42>
      </Div4>
      <Div5>
        <Div51>
          Направление туризма: Экологический - экстремальный;<br></br>
          Маршрут: с.Батагай-Алыта – Хобол.<br></br>
          Протяженность
          маршрута: 150 км.<br></br>
          Продолжительность - 8 дней.<br></br>
          Группа – 6 человек.
          Сезонность – февраль, март, апрель Июнь, июль, август, сентябрь Способ
          передвижения: буран, квадроцикл.<br></br>
          Путешествие на снегоходах по горам и
          перевалам хребта Орулган. Продолжение путешествия по перевалам и
          долине Чуоркаа до заимки Буччэннээх (Кабарожья).С посещением горы
          Ветров (Тыаллаах-Таас). Пеший маршрут 2 км. Посещение сакрального
          урочища «Таас Дунур» (Каменный бубен) или «Юкагирский знак». Ритуал
          подношения духам (молитва об удаче). Восхождение по тропе чубуку.
          Возвращение в Буччээннээх.
        </Div51>
        <Div52>
          <Models5 />
        </Div52>
      </Div5>
    </>
  );
};

export default Home;
